Repository: Boucaa/orbit_bound
Catalog: lib/l10n/intl_*.arb
Languages: cs

source: Hello World!
cs: Ahoj světe!

source: Levels
cs: Úrovně

source: Select Level
cs: Vyberte úroveň

# black_hole_merger_name
source: Black hole merger
cs: Kolize černých děr

# black_hole_merger_description
source: Mergers of black holes have opened a new observational window into the universe, can you navigate through such a merger?
cs: Pozorování gravitačních vln vzniklých srážkami černých děr otevřelo nové observační okno do vesmíru. Dokážete se navigovat takovým sloučením?

# fzu_level_name
source: FZU level
cs: Úroveň FZU

# fzu_level_description
source: Get around the FZU logo to the target. There is more than one way to win, can you figure out all of them?
cs: Objeďte logo FZU k cíli. Existuje více způsobů, jak vyhrát. Dokážete je všechny najít?

# kerr_name
source: Kerr black hole
cs: Rotující černá díra

# kerr_description
source: Most black holes rotate. When a black hole rotates, there is a preferred direction of orbit where spacetime is wound up on the black hole. Effectively, you get slowed when orbiting against this inertial drag, and accelerated if you choose the right direction.
cs: Všechny černé díry ve vesmíru rotují. Když černá díra rotuje, existuje preferovaný směr oběhu, kde se časoprostor navíjí na černou díru. Efektivně se zpomalíte, když obíháte proti tomuto setrvačnému tahu, a zrychlíte, pokud si vyberete správný směr.

# negative_mass_level_name
source: Negative mass level
cs: Úroveň záporné hmotnosti

# negative_mass_level_description
source: How could the physics of negative mass objects work? You can also imagine you are dealing with motion of particles with the same charge. Can you hit the target?
cs: Jak by mohla fungovat fyzika objektů se zápornou hmotností? Můžete si také představit, že se zabýváte pohybem částic se stejným elektromagnetickým nábojem. Dokážete zasáhnout cíl?

# newtonian_object_name
source: Newtonian object
cs: Newtonův objekt

# newtonian_object_description
source: Orbits of test particles around a simple newtonian body are always cone-sections: circles, elipses, parabolas, or hyperbolas. Can you use these orbits, bend the shot, and hit the target?
cs: Dráhy testovacích částic kolem jednoduchého newtonovského tělesa jsou vždy kuželosečky: kružnice, elipsy, paraboly nebo hyperboly. Dokážete využít těchto drah, odklonit střelu a zasáhnout cíl?

# orbitaround_name
source: Stable orbit
cs: Stabilní oběh

# orbitaround_description
source: A common engineering goal is to achieve a stable orbit. Can you try to make a full orbit around a planet?
cs: Běžným inženýrským cílem je dosáhnout stabilní oběžné dráhy. Dokážete provést úplný oběh kolem planety?

# schwarzschild_name
source: Schwarzschild black hole
cs: Schwarzschildova černá díra

# schwarzschild_description
source: The simplest black hole is a spherically symmetric static black hole called the Schwarzschild black hole. Its gravity is so strong that a horizon exist where nothing can escape the immense force. Be careful so you dont fall in!
cs: Nejjednodušší černá díra je sféricky symetrická statická černá díra nazývaná Schwarzschildova černá díra. Její gravitace je tak silná, že existuje horizont, odkud nic nemůže uniknout její obrovské síle. Pozor, abyste nespadli dovnitř!

# slalom_description
source: This level contains only simple newtonian objects with some bothersome barricades, can you take on the challenge?
cs: Tato úroveň obsahuje pouze jednoduché newtonovské objekty s několika překážejícími bariérami. Přijmete výzvu?

# sun_with_planet_name
source: Sun with a planet
cs: Slunce s planetou

# sun_with_planet_description
source: A gravitational slingshot is a maneuver used by many satelites to gain velocity and save fuel. This involves a flyby next to a planets relative motion to a central object. Can you use the planet to get a boost to the target?
cs: Gravitační prak je manévr, který mnoho satelitů používá k získání rychlosti a úsporě paliva. Zahrnuje přelet vedle planety ve vztahu k centrálnímu objektu. Dokážete využít planetu k získání zrychlení k cíli?

# tutorial_name
source: Tutorial
cs: Návod

# tutorial_description
source: Welcome to Orbit Bound! This is a tutorial level to get you started.
cs: Vítejte v Orbit Bound! Toto je úvodní úroveň, která vás naučí základy ovládání.

# variable_gravity_name
source: Variable gravity object
cs: Objekt s proměnlivou gravitací

# variable_gravity_description
source: What if gravity isnt as straightforward as we think it is? Explore the choice of exponent of a 1/r^n potential to hit the target.
cs: Co když gravitace není tak jednoduchá, jak si myslíme? Prozkoumejte volbu exponentu potenciálu 1/r^n a zasáhněte cíl.

# wall_bounce_name
source: Wall Bounce
cs: Odraz od stěny

# wall_bounce_description
source: Bounce the ball off the wall
cs: Odrazte míč od zdi

# target_description
source: This is the target. Your goal is to hit it with the ball.
cs: Toto je cíl. Vaším úkolem je zasáhnout jej míčem.

# ball_description
source: This is the ball.
cs: Toto je míč.

# wall_warning
source: Don't hit the walls and reach the target.
cs: Nenarážejte do zdí a dosáhněte cíle.

# shooting_instruction
source: You can shoot it by dragging your finger or mouse.
cs: Můžete střílet tažením prstem nebo myší.

# good_walls_description
source: These walls are ok to hit. Use them to your advantage.
cs: Do těchto zdí je v pořádku narážet. Využijte je ve svůj prospěch.

# win_message
source: You Win!
cs: Vyhráli jste!

# try_again_message
source: Try Again
cs: Zkuste to znovu

# lose_message
source: You Lose
cs: Prohráli jste
